#+STARTUP: content

* Job Hunting
** Job Information
** Resume
https://github.com/chxin/resume
** DONE Leetcode [[/Users/xin/Documents/Leetcode/makefile][workspace]]
   CLOSED: [2020-06-09 Tue 08:43]
*** TODO leetcode daily
    :PROPERTIES:
    :LAST_REPEAT: [2020-06-06 Sat 13:45]
    :ID:       5FB13F87-D183-41D8-A027-006D6073F9B0
    :END:
    - State "DONE"       from "NEXT"       [2020-06-06 Sat 13:45]
    - State "DONE"       from "NEXT"       [2020-06-05 Fri 13:37]
    - State "DONE"       from "NEXT"       [2020-06-04 Thu 14:52]
    - State "DONE"       from "NEXT"       [2020-05-31 Sun 19:12]
    - State "DONE"       from "NEXT"       [2020-05-30 Sat 13:32]
    - State "DONE"       from "NEXT"       [2020-05-29 Fri 13:56]
    - State "DONE"       from "NEXT"       [2020-05-27 Wed 21:43]
    - State "DONE"       from "NEXT"       [2020-05-25 Mon 21:23]
    - State "DONE"       from "NEXT"       [2020-05-23 Sat 16:55]
    - State "DONE"       from "NEXT"       [2020-05-09 Sat 15:07]
    - State "DONE"       from "NEXT"       [2020-05-08 Fri 13:25]
    - State "DONE"       from "NEXT"       [2020-05-06 Wed 13:58]
    - State "DONE"       from "NEXT"       [2020-05-05 Tue 13:25]
    - State "DONE"       from "NEXT"       [2020-05-04 Mon 17:31]
    - State "DONE"       from "NEXT"       [2020-04-16 Thu 13:51]
    - State "DONE"       from "NEXT"       [2020-04-15 Wed 14:21]
    - State "DONE"       from "NEXT"       [2020-04-14 Tue 11:14]
    - State "DONE"       from "NEXT"       [2020-04-10 Fri 15:15]
    - State "DONE"       from "NEXT"       [2020-04-06 Mon 13:20]
    - State "DONE"       from "NEXT"       [2020-04-05 Sun 14:27]
    - State "DONE"       from "NEXT"       [2020-04-04 Sat 14:22]
    - State "DONE"       from "NEXT"       [2020-04-03 Fri 13:37]
    - State "DONE"       from "NEXT"       [2020-04-01 Wed 15:10]
    - State "DONE"       from "NEXT"       [2020-03-30 Mon 14:01]
    - State "DONE"       from "NEXT"       [2020-03-29 Sun 14:15]
    - State "DONE"       from "NEXT"       [2020-03-28 Sat 17:28]
    - State "DONE"       from "NEXT"       [2020-03-27 Fri 16:34]
    - State "DONE"       from "NEXT"       [2020-03-24 Tue 13:11]
    - State "DONE"       from "NEXT"       [2020-03-23 Mon 20:31]
    - State "done"       from ""           [2020-03-05 Thu 17:00]
    [2020-03-05 Thu 11:19]

    SCHEDULED: <2020-06-07 Sun 13:30 .+1d/2d>
    :PROPERTIES:
    :STYLE: habit
    :REPEAT_TO_STATE: NEXT
    :END:

**** DONE 30.串联所有单词的子串
     CLOSED: [2020-03-13 Fri 18:37]

     [[~/Documents/Leetcode/30.串联所有单词的子串.cpp][solution]]

      :LOGBOOK:
      CLOCK: [2020-03-05 Thu 16:08]--[2020-03-05 Thu 16:59] =>  0:51
      CLOCK: [2020-03-05 Thu 13:41]--[2020-03-05 Thu 14:24] =>  0:43
      :END:

**** DONE 20:有效括号
     CLOSED: [2020-03-13 Fri 18:37]
    :LOGBOOK:
    CLOCK: [2020-03-01 Sun 14:35]--[2020-03-01 Sun 15:15] =>  0:40
    :END:

***** 自己方法未解决
***** 参考[[https://www.cnblogs.com/ariel-dreamland/p/9128258.html][使用堆栈]]的方法AC了
**** DONE 125:验证回文串
     CLOSED: [2020-03-26 Thu 17:31]
     :LOGBOOK:
     CLOCK: [2020-03-26 Thu 16:21]--[2020-03-26 Thu 16:59] =>  0:38
     :END:


*** TODO leetcode solution
从 Leetcode 中精选大概 200左右的题目，去除了某些繁杂但是没有多少算法思想的题目，同时保留了面试中经常被问到的经典题目。

**** 数据结构相关
   1. [[file:~/Documents/Leetcode/note/Leetcode-%E9%93%BE%E8%A1%A8.org][链表]]
   2. [[file:~/Documents/Leetcode/note/Leetcode-%E6%A0%91.org][树]]
   3. [[file:~/Documents/Leetcode/note/Leetcode-栈和队列.org][栈和队列]]
   4. [[file:~/Documents/Leetcode/note/Leetcode-哈希表.org][哈希表]]
   5. [[file:~/Documents/Leetcode/note/Leetcode-字符串.org][字符串]]
   6. [[file:~/Documents/Leetcode/note/Leetcode-数组与矩阵.org][数组与矩阵]]
   7. [[file:~/Documents/Leetcode/note/Leetcode-图.org][图]]
   8. [[file:~/Documents/Leetcode/note/Leetcode-位运算.org][位运算]]

**** 算法思想
   1. [[file:~/Documents/Leetcode/note/Leetcode-双指针.org][双指针]]
   2. [[file:~/Documents/Leetcode/note/Leetcode-排序.org][排序]]
   3. [[file:~/Documents/Leetcode/note/Leetcode-贪心思想.org][贪心思想]]
   4. [[file:~/Documents/Leetcode/note/Leetcode-二分查找.org][二分查找]]
   5. [[file:~/Documents/Leetcode/note/Leetcode-分治.org][分治]]
   6. [[file:~/Documents/Leetcode/note/Leetcode-搜索.org][搜索]]
   7. [[file:~/Documents/Leetcode/note/Leetcode-动态规划.org][动态规划]]
   8. [[file:~/Documents/Leetcode/note/Leetcode-数学.org][数学]]

**** 参考资料
   1. Leetcode
   2. Weiss M A, 冯舜玺. 数据结构与算法分析------C 语言描述[J]. 2004.
   3. Sedgewick R. Algorithms[M]. Pearson Education India, 1988.
   4. 何海涛, 软件工程师. 剑指 Offer: 名企面试官精讲典型编程题[M]. 电子工业出版社, 2014.
   5. 《编程之美》小组. 编程之美[M]. 电子工业出版社, 2008.
   6. 左程云. 程序员代码面试指南[M]. 电子工业出版社, 2015.
** Reading Milestone
*** software basic knowledge [0/4]
   - [ ] C++ primer
   - [ ] algorithm introduction
   - [ ] network
   - [ ] embedded linux

*** hardware basic knowledge [0/1]
   - [ ] FPGA
   - [ ] Digital Circuit

** Interview Skills
** Knowledge
